# __Importing Pandas/Numpy/Zipfile and Opening CSV files__

In [300]:
# importing pandas, numpy and zipfile
import zipfile
import pandas as pd
import numpy as np
from dateutil.relativedelta import relativedelta

In [301]:
ls

README.md                student.ipynb
stephanie_ciaccia.ipynb  zippedData/

In [302]:
## opening read file
ratings = pd.read_csv('zippedData/tmdb.movies.csv.gz',compression='gzip')
budget = pd.read_csv('zippedData/tn.movie_budgets.csv.gz',compression='gzip')

# Inspecting - TMDB movies (df)

In [303]:
df.head(5)

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [304]:
ratings.describe()

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

In [305]:
ratings.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

In [306]:
ratings.columns

Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [307]:
ratings.shape

(26517, 10)

In [308]:
# checking for null values
ratings.isna().sum()

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [309]:
ratings.dtypes

Unnamed: 0             int64
genre_ids             object
id                     int64
original_language     object
original_title        object
popularity           float64
release_date          object
title                 object
vote_average         float64
vote_count             int64
dtype: object

# __Cleaning Dataframe - TMDB__

In [312]:
##removing 'Unnamed: Column 0' as it is a repeat of the values in the index

ratings = ratings.drop(["Unnamed: 0"], axis = 1)

In [313]:
ratings.dtypes

genre_ids             object
id                     int64
original_language     object
original_title        object
popularity           float64
release_date          object
title                 object
vote_average         float64
vote_count             int64
dtype: object

In [314]:
ratings.head(5)

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [315]:
## converting 'release_date' column type from integer to datetime

ratings['release_date'] = pd.to_datetime(ratings['release_date'])

In [316]:
ratings['release_date']

0       2010-11-19
1       2010-03-26
2       2010-05-07
3       1995-11-22
4       2010-07-16
           ...
26512   2018-10-13
26513   2018-05-01
26514   2018-10-01
26515   2018-06-22
26516   2018-10-05
Name: release_date, Length: 26517, dtype: datetime64[ns]

# Inspecting - TN movies budget (df2)

In [317]:
budget

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [216]:
budget.head(5)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [217]:
budget.dtypes

id                    int64
release_date         object
movie                object
production_budget    object
domestic_gross       object
worldwide_gross      object
dtype: object

# Cleaning - TN movies budget (df2)#

In [218]:
### changing type of release Date to datetime

budget['release_date'] = pd.to_datetime(df['release_date'])

In [219]:
### removing $ and , from Production Budget and and changing type to integer

budget['production_budget'] = budget['production_budget'].str.replace('$', '')
budget['production_budget'] = budget['production_budget'].str.replace(',', '')
budget['production_budget'] = budget['production_budget'].astype(int)

In [220]:
### removing $ and , from Domestic Gross and and changing type to integer

budget['domestic_gross'] = budget['domestic_gross'].str.replace('$', '')
budget['domestic_gross'] = budget['domestic_gross'].str.replace(',', '')
budget['domestic_gross'] = budget['domestic_gross'].astype(int)

In [225]:
### removing $ and , from Worldwide Gross and changing type to integer

budget['worldwide_gross'] = budget['worldwide_gross'].str.replace('$', '')
budget['worldwide_gross'] = budget['worldwide_gross'].str.replace(',', '')
budget['worldwide_gross'] = budget['worldwide_gross'].astype(int)

In [222]:
#sanity check w/ data types
budget.dtypes

id                            int64
release_date         datetime64[ns]
movie                        object
production_budget             int64
domestic_gross                int64
worldwide_gross              object
dtype: object

In [223]:
#checking for null values
budget.isna( ).sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [224]:
budget.describe()

                id  production_budget  domestic_gross
count  5782.000000       5.782000e+03    5.782000e+03
mean     50.372363       3.158776e+07    4.187333e+07
std      28.821076       4.181208e+07    6.824060e+07
min       1.000000       1.100000e+03    0.000000e+00
25%      25.000000       5.000000e+06    1.429534e+06
50%      50.000000       1.700000e+07    1.722594e+07
75%      75.000000       4.000000e+07    5.234866e+07
max     100.000000       4.250000e+08    9.366622e+08

In [227]:
budget.head(5)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,2010-11-19,Avatar,425000000,760507625,2776345279
1,2,2010-03-26,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,2010-05-07,Dark Phoenix,350000000,42762350,149762350
3,4,1995-11-22,Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,2010-07-16,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

# Analyzing

In [231]:
budget['worldwide_gross'].

0            367
8000000        9
7000000        6
2000000        6
4000000        4
            ...
166000000      1
42843521       1
101173038      1
478595         1
12996          1
Name: worldwide_gross, Length: 5356, dtype: int64

In [235]:

oldest_movie = min(budget['release_date'])
newest_movie = max(budget['release_date'])

print(oldest_movie)
print(newest_movie)

1936-02-27 00:00:00
2017-03-15 00:00:00

In [248]:
movie_range = relativedelta(newest_movie, oldest_movie).years
movie_range

81

In [252]:
top_5_movies = budget.sort_values(by='worldwide_gross',ascending=False).head(20)
top_5_movies

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,2010-11-19,Avatar,425000000,760507625,2776345279
42,43,2010-06-24,Titanic,200000000,659363944,2208208395
5,6,2010-02-11,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220
6,7,2009-12-18,Avengers: Infinity War,300000000,678815482,2048134200
33,34,2007-08-03,Jurassic World,215000000,652270625,1648854864
66,67,2010-07-27,Furious 7,190000000,353007020,1518722794
26,27,1995-04-07,The Avengers,225000000,623279547,1517935897
3,4,1995-11-22,Avengers: Age of Ultron,330600000,459005868,1403013963
41,42,2010-08-13,Black Panther,200000000,700059566,1348258224
260,61,2010-08-20,Harry Potter and the Deathly Hallows: Part II,125000000,381193157,1341693157
4,5,2010-07-16,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
112,13,2010-01-25,Jurassic World: Fallen Kingdom,170000000,417719760,1305772799
155,56,2010-05-01,Frozen,150000000,400738009,1272469910
134,35,2010-09-15,Beauty and the Beast,160000000,504014165,1259199706
43,44,1959-03-18,Incredibles 2,200000000,608581744,1242520711
22,23,2010-12-10,The Fate of the Furious,250000000,225764765,1234846267
47,48,2010-12-03,Iron Man 3,200000000,408992272,1215392272
672,73,2009-01-18,Minions,74000000,336045770,1160336173
135,36,2010-10-08,Aquaman,160000000,335061807,1146894640
425,26,2010-11-05,The Lord of the Rings: The Return of the King,94000000,377845905,1141403341

In [280]:
top_20_movies = budget.sort_values(by="worldwide_gross",ascending=False).head(25)
top_20_movies

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,2010-11-19,Avatar,425000000,760507625,2776345279
42,43,2010-06-24,Titanic,200000000,659363944,2208208395
5,6,2010-02-11,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220
6,7,2009-12-18,Avengers: Infinity War,300000000,678815482,2048134200
33,34,2007-08-03,Jurassic World,215000000,652270625,1648854864
66,67,2010-07-27,Furious 7,190000000,353007020,1518722794
26,27,1995-04-07,The Avengers,225000000,623279547,1517935897
3,4,1995-11-22,Avengers: Age of Ultron,330600000,459005868,1403013963
41,42,2010-08-13,Black Panther,200000000,700059566,1348258224
260,61,2010-08-20,Harry Potter and the Deathly Hallows: Part II,125000000,381193157,1341693157
4,5,2010-07-16,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
112,13,2010-01-25,Jurassic World: Fallen Kingdom,170000000,417719760,1305772799
155,56,2010-05-01,Frozen,150000000,400738009,1272469910
134,35,2010-09-15,Beauty and the Beast,160000000,504014165,1259199706
43,44,1959-03-18,Incredibles 2,200000000,608581744,1242520711
22,23,2010-12-10,The Fate of the Furious,250000000,225764765,1234846267
47,48,2010-12-03,Iron Man 3,200000000,408992272,1215392272
672,73,2009-01-18,Minions,74000000,336045770,1160336173
135,36,2010-10-08,Aquaman,160000000,335061807,1146894640
425,26,2010-11-05,The Lord of the Rings: The Return of the King,94000000,377845905,1141403341
16,17,2010-01-11,Captain America: Civil War,250000000,408084349,1140069413
63,64,2010-07-23,Transformers: Dark of the Moon,195000000,352390543,1123790543
95,96,2010-08-20,Captain Marvel,175000000,426525952,1123061550
51,52,2010-08-06,Skyfall,200000000,304360277,1110526981
36,37,2010-05-14,Transformers: Age of Extinction,210000000,245439076,1104039076